src/Catalogs/Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Кассы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеСписаниеМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтСдачаВыемкиПриЗакрытииСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьПечатьЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФФДдляККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнееОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыемкаИзКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершатьАвтоматическиОперацииВемкиВнесения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДляСдачиВыручки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККММарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМНомерПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМНомерРегистрационный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаватьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьКопииЧеков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьКопииЧековКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКассира</Name>
					<Comment>0 - "Фамилия Имя Отчество"1. "Фамилия Имя"2. "Фамилия И.О."3. "Фамилия И."4. "Фамилия"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетЭлектронногоЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКасс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматТелефонногоНомераДляОтправкиЭлектронныхЧековККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекEmailПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекSMSПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Секции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СегментНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробиватьНефискальныйЧек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИспользовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭквайринговыеТерминалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭквайринговыйТерминал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НоменклатураСегмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураСегмента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПречековыйПринтер</Name>
					<Comment>BeforeCheckPrinters</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>API</Name>
					<Comment>API</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПлатежныеШлюзы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПлатежныеШлюзы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сбербанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбербанкПлатиQR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПАльфаБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПРайффайзенБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПСбербанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПСДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПТинькофф</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Кассы/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция получает блокируемые реквизиты объекта.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВалютаДенежныхСредств");
	Результат.Добавить("Владелец");
	Результат.Добавить("СтруктурнаяЕдиница");
	Результат.Добавить("Склад");
	Результат.Добавить("ТипКассы");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Функция определяет кассу по умолчанию.
//
// Возвращает кассу, если найдена одна касса.
// Возвращает Неопределено, если касса не найдена или касс больше одной.
//
// Возвращаемое значение:
//	СправочникСсылка.Кассы - Найденная касса
//
Функция ПолучитьАвтономнуюКассуПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	                      |	Кассы.Ссылка КАК Касса
	                      |ИЗ
	                      |	Справочник.Кассы КАК Кассы
	                      |ГДЕ
	                      |	НЕ Кассы.ПометкаУдаления");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 
	   И Выборка.Следующий()
	Тогда
		Касса = Выборка.Касса;
	Иначе
		Касса = Неопределено;
	КонецЕсли;
	
	Возврат Касса;

КонецФункции // ПолучитьКассуПоУмолчанию()

// Функция определяет валюту выбранной кассы.
//
// Параметры:
//  Касса - СправочникСсылка.Кассы - Ссылка на кассу
//
// Возвращаемое значение:
//	Структура - Организация и Валюта выбранной кассы
//
Функция ПолучитьРеквизитыКассы(Касса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кассы.Склад КАК Склад,
	|	Кассы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Кассы.Владелец КАК Организация
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.Ссылка = &Касса";
	
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Склад           	= Выборка.Склад;
		СтруктурнаяЕдиница  = Выборка.СтруктурнаяЕдиница; 
	Иначе
		Склад           	= Неопределено;
		СтруктурнаяЕдиница  = Неопределено;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Склад, СтруктурнаяЕдиница, Организация",
		Склад,
		СтруктурнаяЕдиница
	);
	
	Возврат СтруктураРеквизитов;

КонецФункции // ПолучитьРеквизитыКассыККМ()
                                
// Функция определяет кассу выбранной организации.
//
Функция ПолучитьКассуПоУмолчанию(Организация, Валюта = Неопределено) Экспорт
	//
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	//|	Кассы.Ссылка КАК Касса
	//|ИЗ
	//|	Справочник.Кассы КАК Кассы
	//|ГДЕ
	//|	Не Кассы.ПометкаУдаления
	//|	И (Кассы.Владелец = &Организация
	//|		ИЛИ &Организация = Неопределено)
	//|	И (Кассы.ВалютаДенежныхСредств = &Валюта
	//|		ИЛИ &Валюта = Неопределено)
	//|");
	//
	//Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	//Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Количество() = 1 
	//   И Выборка.Следующий()
	//Тогда
	//	Касса = Выборка.Касса;
	//Иначе
	//	Касса = Справочники.Кассы.ПустаяСсылка();
	//КонецЕсли;
	
	Возврат ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.ОсновнаяКасса;

КонецФункции // ПолучитьКассуПоУмолчанию()

// Вернет признак фискальности указанного вида оплаты для данной кассы.
//
Функция ПолучитьПризнакФискальностиВидаОплатыПоКассе(Касса, ВидОплаты) Экспорт
	
	СтрокиТБ = Касса.ВидыОплат.НайтиСтроки(Новый Структура("ВидОплаты",ВидОплаты));
	Если СтрокиТБ.Количество() = 0 Тогда
		Возврат Истина;
	 Иначе
		Возврат НЕ СтрокиТБ[0].ПробиватьНефискальныйЧек;
	КонецЕсли;
	
КонецФункции

// Функция возвращает признак использования вида оплаты.
//
Функция ПолучитьПризнакИспользованияВидаОплатыПоКассе(Касса, ТипОплаты) Экспорт
	
	СтрокиТБ = Касса.ВидыОплат.НайтиСтроки(Новый Структура("ВидОплаты",ТипОплаты));
	Если СтрокиТБ.Количество() = 0 Тогда
		Возврат Ложь;
	 Иначе
		Возврат НЕ СтрокиТБ[0].НеИспользовать;
	КонецЕсли;	
	
КонецФункции

// Функция - Получить кассы по структурной единице
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКассыПоСтруктурнойЕдинице(СтруктурнаяЕдиница) Экспорт 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кассы.Ссылка КАК Касса,
	|	Кассы.ИспользоватьБезПодключенияОборудования
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НЕ Кассы.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Возврат Запрос.Выполнить().Выгрузить(); 	
	
КонецФункции

// Функция - Использовать старую систему формирования для ф рдля ККТ
//
// Параметры:
//  Касса	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИспользоватьСтаруюСистемуФормированияДляФРдляККТ(Касса) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Функция - проверяет использует ли касса ККТ.
//
Функция КассаИспользуетсяККТ(Касса) Экспорт
	
	Возврат Касса.ВнешнееОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
		
КонецФункции

// Функция, возвращает секцию номенклатуры.
//
Функция ПолучитьСекциюНоменклатуры(Номенклатура, Касса) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Касса"		, Касса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассыСекции.НомерСекции
	|ИЗ
	|	Справочник.Кассы.Секции КАК КассыСекции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|		ПО КассыСекции.СегментНоменклатуры = НоменклатураСегмента.Сегмент
	|ГДЕ
	|	КассыСекции.Ссылка = &Касса
	|	И НоменклатураСегмента.Номенклатура = &Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.НомерСекции, 1);
	
КонецФункции

// Функция - Вернуть доступные кассы по структурным единицам.
//
// Параметры:
//  МассивСтруктурныхЕдиниц	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьДоступныеКассы(МассивСтруктурныхЕдиниц) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кассы.Ссылка КАК Касса,
	|	ВЫБОР
	|		КОГДА НЕ Кассы.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ИндКартинки
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.ЭтоГруппа = ЛОЖЬ
	|	И Кассы.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)";
	
	Если ЗначениеЗаполнено(МассивСтруктурныхЕдиниц) Тогда
  		Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МассивСтруктурныхЕдиниц);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Кассы.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)", "ЛОЖЬ");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать();
		
КонецФункции

// Функция - Возвращает доступные кассы к оплате в последовательности убывания приоритета.
//
// Параметры:
//  СтруктурнаяЕдиница 	- 	 Справочник.СтруктурныеЕдиницы
//  Организация 		- 	 Справочник.Организации  
//  Сотрудник 		    - 	 Справочник.Сотрудники
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКассыДляОплаты(СтруктурнаяЕдиница, Организация = Неопределено, Сотрудник = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда 
		Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	ИначеЕсли ОбщегоНазначения.ПолучитьЗначениеРеквизита(Сотрудник,"ЭтоПользовательИБ") = Ложь Тогда 
		Возврат Новый Массив;		
	КонецЕсли; 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиДоступныеКассы.Касса КАК Касса
	|ИЗ
	|	Справочник.Сотрудники.ДоступныеКассы КАК СотрудникиДоступныеКассы
	|ГДЕ
	|	СотрудникиДоступныеКассы.Ссылка = &Сотрудник
	|	И СотрудникиДоступныеКассы.Касса.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И СотрудникиДоступныеКассы.Касса.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &Организация <> НЕОПРЕДЕЛЕНО
	|				ТОГДА СотрудникиДоступныеКассы.Касса.СтруктурнаяЕдиница.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО                                                                                                     
	|	ВЫБОР
	|		КОГДА СотрудникиДоступныеКассы.Основная = ИСТИНА
	|			ТОГДА 1
	|		КОГДА СотрудникиДоступныеКассы.Касса.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И СотрудникиДоступныеКассы.Касса.СтруктурнаяЕдиница.ОсновнаяКасса = СотрудникиДоступныеКассы.Касса
	|			ТОГДА 2
	|		КОГДА СотрудникиДоступныеКассы.Касса.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ТОГДА 3
	|		КОГДА СотрудникиДоступныеКассы.Касса.СтруктурнаяЕдиница.Организация = &Организация
	|			ТОГДА 4
	|	КОНЕЦ");
			
	Запрос.УстановитьПараметр("Сотрудник"		  , Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация"		  , ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Касса");
		
КонецФункции 

// Функция - получает все кассы по эквайринговому терминалу
//
// Параметры:
//  ЭквайринговыйТерминал - СправочникСсылка "ЭквайринговыйТерминал" 
// 
// Возвращаемое значение:
//   Массив касс 
//
Функция ПолучитьКассуПоЭквайринговомуТерминалу(ЭквайринговыйТерминал) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассыЭквайринговыеТерминалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кассы.ЭквайринговыеТерминалы КАК КассыЭквайринговыеТерминалы
	|ГДЕ
	|	КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал = &ЭквайринговыйТерминал");
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.Кассы.ПустаяСсылка());
	
КонецФункции

// Функция - Получить кассы ссылок на оплату и сбп
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКассыСсылокНаОплатуИСбп(СтруктурнаяЕдиница) Экспорт
		
	МассивТиповБанка = Новый Массив;
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПАльфаБанк);	
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк);
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПТинькофф);
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПСбербанк);
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR);
	МассивТиповБанка.Добавить(Перечисления.ПлатежныеШлюзы.СБПСДМ);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КассыЭквайринговыеТерминалы.Ссылка КАК Касса,
	|	ЛОЖЬ КАК КассаДоступна,
	|	ЛОЖЬ КАК ФРИспользуется,
	|	ИСТИНА КАК ИспользуетсяОнлайн
	|ИЗ
	|	Справочник.Кассы.ЭквайринговыеТерминалы КАК КассыЭквайринговыеТерминалы
	|ГДЕ
	|	КассыЭквайринговыеТерминалы.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.ПометкаУдаления = ЛОЖЬ
	|	И КассыЭквайринговыеТерминалы.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.Организация = КассыЭквайринговыеТерминалы.Ссылка.Организация
	|	И (КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.ИспользоватьОплатуПоСсылке
	|			ИЛИ КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал.ТипБанка В (&МассивТиповБанка))");
		
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("МассивТиповБанка"		, МассивТиповБанка);

	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

// Функция, возвращает кассу оплаты по эквайринговому терминалу.
//
Функция ПолучитьКассуОплатыИПараметрыФискализации(ЭквайринговыйТерминал, ПараметрыФискализации = Неопределено) Экспорт
	
	Переменная_КассовыйСервер = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭквайринговыйТерминал, "КассовыйСервер");
	ПараметрыКассовогоСервера = Неопределено;
	
	Если ЗначениеЗаполнено(Переменная_КассовыйСервер) Тогда
		ПараметрыКассовогоСервера = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Переменная_КассовыйСервер, "Параметры").Получить();
	КонецЕсли;
	
	ОтправлятьВLifePay 		   = Ложь;
	ОтправлятьВCloudKassir	   = Ложь;
	КассовыйСерверИспользуется = Ложь;
	ОтправлятьВCheckbox 	   = Ложь;
	ОтправлятьВЭвотор    	   = Ложь;
	
	Если ЗначениеЗаполнено(Переменная_КассовыйСервер.ДрайверОборудования)
		И Переменная_КассовыйСервер.ДрайверОборудования.ИмяПредопределенныхДанных = "ДрайверLifePayККТ54ФЗ" Тогда
		
		МассивКассОплаты = Справочники.Кассы.ПолучитьКассуПоТерминалуЭквайринга(ЭквайринговыйТерминал);
		КассаОплаты      = ?(ЗначениеЗаполнено(МассивКассОплаты), МассивКассОплаты[0], Неопределено);
		
		ОтправлятьВLifePay = ЗначениеЗаполнено(КассаОплаты);
		
	ИначеЕсли ЗначениеЗаполнено(Переменная_КассовыйСервер.ДрайверОборудования) 
		И Переменная_КассовыйСервер.ДрайверОборудования.ИмяПредопределенныхДанных  = "ДрайверCloudKassirККТ54ФЗ" Тогда
		
		МассивКассОплаты = Справочники.Кассы.ПолучитьКассуПоТерминалуЭквайринга(ЭквайринговыйТерминал);
		КассаОплаты      = ?(ЗначениеЗаполнено(МассивКассОплаты), МассивКассОплаты[0], Неопределено);
		
		ОтправлятьВCloudKassir = ЗначениеЗаполнено(КассаОплаты);
		
	ИначеЕсли ЗначениеЗаполнено(Переменная_КассовыйСервер.ДрайверОборудования) 
		И Переменная_КассовыйСервер.ДрайверОборудования.ИмяПредопределенныхДанных  = "ДрайверCheckboxККТ" Тогда
		
		МассивКассОплаты = Справочники.Кассы.ПолучитьКассуПоТерминалуЭквайринга(ЭквайринговыйТерминал);
		КассаОплаты      = ?(ЗначениеЗаполнено(МассивКассОплаты), МассивКассОплаты[0], Неопределено);
		
		ОтправлятьВCheckbox = ЗначениеЗаполнено(КассаОплаты);
		
	ИначеЕсли ЗначениеЗаполнено(Переменная_КассовыйСервер.ДрайверОборудования)
		И Переменная_КассовыйСервер.ДрайверОборудования.ИмяПредопределенныхДанных = "ДрайверЭвоторККТ54ФЗ" Тогда
		
		МассивКассОплаты = Справочники.Кассы.ПолучитьКассуПоТерминалуЭквайринга(ЭквайринговыйТерминал);
		КассаОплаты      = ?(ЗначениеЗаполнено(МассивКассОплаты), МассивКассОплаты[0], Неопределено);
		
		ОтправлятьВЭвотор = ЗначениеЗаполнено(КассаОплаты);

	ИначеЕсли ТипЗнч(ПараметрыКассовогоСервера) = Тип("Структура") И ПараметрыКассовогоСервера.Свойство("КассаОплаты") Тогда
		
		КассаОплаты 			   = ПараметрыКассовогоСервера.КассаОплаты;
		КассовыйСерверИспользуется = Истина;
		
	Иначе
		МассивКассОплаты = Справочники.Кассы.ПолучитьКассуПоТерминалуЭквайринга(ЭквайринговыйТерминал);
		КассаОплаты      = ?(ЗначениеЗаполнено(МассивКассОплаты), МассивКассОплаты[0], Неопределено);
	КонецЕсли;
	
	ПараметрыФискализации = Новый Структура("ОтправлятьДанныеВLifePay, ОтправлятьДанныеВCloudKassir, КассовыйСерверИспользуется, ОтправлятьДанныеВCheckbox, ОтправлятьДанныеВЭвотор", 
		ОтправлятьВLifePay, ОтправлятьВCloudKassir, КассовыйСерверИспользуется, ОтправлятьВCheckbox, ОтправлятьВЭвотор);
	Возврат КассаОплаты;
	
КонецФункции

// Функция - получает все кассы по эквайринговому терминалу
//
// Параметры:
//  ЭквайринговыйТерминал - СправочникСсылка "ЭквайринговыйТерминал" 
// 
// Возвращаемое значение:
//   Массив касс 
//
Функция ПолучитьКассуПоТерминалуЭквайринга(ЭквайринговыйТерминал) Экспорт
		
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЭквайринговыеТерминалыКассы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Кассы.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалыКассы
		|ГДЕ
		|	ЭквайринговыеТерминалыКассы.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ЭквайринговыеТерминалыКассы.ЭквайринговыйТерминал = &ЭквайринговыйТерминал");
				
		Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	   		
КонецФункции

#КонецОбласти
